// Очень многое в JavaScript является объектами

// Если объект как значение свойства объекта - называется вложенным объектом

// Массив - объект
// Функция - объект
// Число - объект
// Строка - объект
// Строки и числа только ведут себя как объекты

// Интерпритатор может возвращать undefined (в консоли) - значение, которое возвращает выражение

// console.dir() - отображает все свойства объекта
// console.table() - отображает все свойства объекта в табличном виде

// Выражение возвращает значение
// Присовение тоже выражение

// Результатом каждого выражения является - значение


// Pascal case - для типов и классов
// Constant case - для констант
// Camel case - для всех других переменных

